articles/fix_filename_encoding_for_zip_archive_with_python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-27 Fri 09:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fix filename encoding for zip archive with Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lei Zhao" />
<link type="text/css" href="../styles/syntax-highlight.css" rel="stylesheet"/>
<link type="text/css" href="../styles/layout.css" rel="stylesheet"/>
</head>
<body>
<div id="content">
<h1 class="title">Fix filename encoding for zip archive with Python</h1>
<p>
Sometimes after unzipping some ZIP archives you get from the Internet,
you get directories and files with <a href="https://en.wikipedia.org/wiki/Mojibake">mojibake</a> names.  The names in a ZIP
file are bytes without any encoding information, and it is up to the
unzipping tool to decide which encoding the names use.
</p>

<p>
According to the python <a href="https://docs.python.org/3/library/zipfile.html#zipfile.ZipFile.write">zipfile</a> module, typical ZIP tools interprets
file names as encoded in <a href="https://en.wikipedia.org/wiki/Code_page_437">CP437</a>, if they cannot decide the original
encoding.
</p>

<p>
The following demostrates the mojibake result with a ZIP archive
encoded in <a href="https://en.wikipedia.org/wiki/GBK">GBK</a> for file names.  The archive is generated by <a href="https://en.wikipedia.org/wiki/Baidu_Wangpan">Baidu
Wangpan</a>, which enforces GBK.  They might do it for compatibilities
with legacy Chinese system, but I think they should really enforce
UTF-8 instead of GBK.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> zipfile <span class="org-keyword">import</span> ZipFile
<span class="org-variable-name">zname</span> = <span class="org-string">'&#12304;&#25209;&#37327;&#19979;&#36733;&#12305;&#31532;&#19968;&#33410; &#27010;&#24565;&#19982;&#24615;&#36136;&#31561;.zip'</span>
<span class="org-variable-name">zf</span> = ZipFile(zname)
zf.namelist()
</pre>
</div>

<ul class="org-ul">
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╥╗╜┌ ╕┼─ε╙δ╨╘╓╩.pdf</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/userCommands.tex</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╢■╜┌ ╗╗╘¬╗²╖╓╖¿.pdf</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╚²╜┌ ╖╓▓┐╗²╖╓╖¿.pdf</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╢■╜┌ ╗╗╘¬╗²╖╓╖¿.tex</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╚²╜┌ ╖╓▓┐╗²╖╓╖¿.tex</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/╡┌╥╗╜┌ ╕┼─ε╙δ╨╘╓╩.tex</li>
<li>╬ó╗²╖╓B(1)/╡┌11╓▄╜▓┐╬╠ß╕┘/config.tex</li>
</ul>


<p>
The tool cannot decode the file name correctly so it interprets them
as in CP437.  To get the original bytes in Python 3, just re-encode
them in CP437.  With those bytes, you can get correctly decoded file
name by decoding them in GBK.
</p>

<div class="org-src-container">
<pre class="src src-python">[s.encode(<span class="org-string">'cp437'</span>).decode(<span class="org-string">'gbk'</span>) <span class="org-keyword">for</span> s <span class="org-keyword">in</span> zf.namelist()]
</pre>
</div>

<ul class="org-ul">
<li>微积分B(1)/第11周讲课提纲/第一节 概念与性质.pdf</li>
<li>微积分B(1)/第11周讲课提纲/userCommands.tex</li>
<li>微积分B(1)/第11周讲课提纲/第二节 换元积分法.pdf</li>
<li>微积分B(1)/第11周讲课提纲/第三节 分部积分法.pdf</li>
<li>微积分B(1)/第11周讲课提纲/第二节 换元积分法.tex</li>
<li>微积分B(1)/第11周讲课提纲/第三节 分部积分法.tex</li>
<li>微积分B(1)/第11周讲课提纲/第一节 概念与性质.tex</li>
<li>微积分B(1)/第11周讲课提纲/config.tex</li>
</ul>

<p>
The first bad news is that you cannot decide the original encoding
beforehand without any guesswork.  I guess by the language of the
content and it works reasonably.
</p>

<p>
Another bad news is that you cannot update the ZIP archive in-place,
even the famous <a href="http://www.info-zip.org/FAQ.html#rename">Info-Zip</a> makes a temporary copy while renaming files.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> copy <span class="org-keyword">import</span> copy
<span class="org-keyword">from</span> os <span class="org-keyword">import</span> remove, rename
<span class="org-keyword">from</span> os.path <span class="org-keyword">import</span> dirname
<span class="org-keyword">from</span> tempfile <span class="org-keyword">import</span> NamedTemporaryFile

<span class="org-variable-name">LANG_FLAG</span> = 0x800
<span class="org-variable-name">OS_FLAG</span> = 3

<span class="org-keyword">with</span> NamedTemporaryFile(<span class="org-builtin">dir</span>=dirname(zname), delete=<span class="org-constant">False</span>) <span class="org-keyword">as</span> tf:
    <span class="org-keyword">with</span> ZipFile(tf, mode=<span class="org-string">'w'</span>) <span class="org-keyword">as</span> ztf:
        <span class="org-variable-name">ztf.comment</span> = zf.comment
        <span class="org-keyword">for</span> zinfo <span class="org-keyword">in</span> zf.infolist():
            <span class="org-variable-name">zinfo.CRC</span> = <span class="org-constant">None</span>
            <span class="org-variable-name">ztinfo</span> = copy(zinfo)
            <span class="org-variable-name">ztinfo.filename</span> = zinfo.filename.encode(<span class="org-string">'cp437'</span>).decode(<span class="org-string">'gbk'</span>)
            <span class="org-variable-name">ztinfo.flag_bits</span> |= LANG_FLAG
            <span class="org-variable-name">ztinfo.create_system</span> = OS_FLAG
            ztf.writestr(ztinfo, zf.read(zinfo))

zf.close()
remove(zname)
rename(tf.name, zname)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">unzip -l &#12304;&#25209;&#37327;&#19979;&#36733;&#12305;&#31532;&#19968;&#33410;<span class="org-string">\ </span>&#27010;&#24565;&#19982;&#24615;&#36136;&#31561;.zip
</pre>
</div>

<pre class="example">
Archive:  【批量下载】第一节 概念与性质等.zip
  Length      Date    Time    Name
---------  ---------- -----   ----
   347005  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第一节 概念与性质.pdf
      387  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/userCommands.tex
   241502  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第二节 换元积分法.pdf
   203684  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第三节 分部积分法.pdf
     6041  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第二节 换元积分法.tex
     3123  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第三节 分部积分法.tex
     8972  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/第一节 概念与性质.tex
      176  2015-06-20 01:40   微积分B(1)/第11周讲课提纲/config.tex
---------                     -------
   810890                     8 files
</pre>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lei Zhao</p>
<p class="date">Created: 2017-10-27 Fri 09:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
